Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 16000)]         0                                            
__________________________________________________________________________________________________
speech_features (SpeechFeatures (1, 98, 40)          0           input_audio[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (1, 98, 40, 1)       0           speech_features[0][0]            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (1, 98, 40, 10)      60          tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (1, 98, 40, 10)      40          conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (1, 98, 40, 1)       51          batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (1, 98, 40, 1)       4           conv2d_1[0][0]                   
__________________________________________________________________________________________________
reshape (Reshape)               (1, 98, 40)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (1, 98, 256)         130560      reshape[0][0]                    
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (1, 98, 256)         296448      bidirectional[0][0]              
__________________________________________________________________________________________________
tf_op_layer_strided_slice (Tens (1, 256)             0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (1, 256)             65792       tf_op_layer_strided_slice[0][0]  
__________________________________________________________________________________________________
dense_1 (Dense)                 (1, 256)             65792       tf_op_layer_strided_slice[0][0]  
__________________________________________________________________________________________________
dense_2 (Dense)                 (1, 256)             65792       tf_op_layer_strided_slice[0][0]  
__________________________________________________________________________________________________
dense_3 (Dense)                 (1, 256)             65792       tf_op_layer_strided_slice[0][0]  
__________________________________________________________________________________________________
dot (Dot)                       (1, 98)              0           dense[0][0]                      
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dot_2 (Dot)                     (1, 98)              0           dense_1[0][0]                    
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dot_4 (Dot)                     (1, 98)              0           dense_2[0][0]                    
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dot_6 (Dot)                     (1, 98)              0           dense_3[0][0]                    
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
softmax (Softmax)               (1, 98)              0           dot[0][0]                        
__________________________________________________________________________________________________
softmax_1 (Softmax)             (1, 98)              0           dot_2[0][0]                      
__________________________________________________________________________________________________
softmax_2 (Softmax)             (1, 98)              0           dot_4[0][0]                      
__________________________________________________________________________________________________
softmax_3 (Softmax)             (1, 98)              0           dot_6[0][0]                      
__________________________________________________________________________________________________
dot_1 (Dot)                     (1, 256)             0           softmax[0][0]                    
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dot_3 (Dot)                     (1, 256)             0           softmax_1[0][0]                  
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dot_5 (Dot)                     (1, 256)             0           softmax_2[0][0]                  
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dot_7 (Dot)                     (1, 256)             0           softmax_3[0][0]                  
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
concatenate (Concatenate)       (1, 1024)            0           dot_1[0][0]                      
                                                                 dot_3[0][0]                      
                                                                 dot_5[0][0]                      
                                                                 dot_7[0][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (1, 1024)            0           concatenate[0][0]                
__________________________________________________________________________________________________
dense_4 (Dense)                 (1, 64)              65600       dropout[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (1, 12)              780         dense_4[0][0]                    
==================================================================================================
Total params: 756,711
Trainable params: 756,689
Non-trainable params: 22
__________________________________________________________________________________________________