Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(1, 16000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 98, 40)               0         
_________________________________________________________________
kws_transformer (KWSTransfor (1, 64)                   606528    
_________________________________________________________________
sequential_12 (Sequential)   multiple                  780       
=================================================================
Total params: 607,308
Trainable params: 607,308
Non-trainable params: 0
_________________________________________________________________