Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(100, 16000)]            0         
_________________________________________________________________
speech_features (SpeechFeatu (100, 98, 40)             0         
_________________________________________________________________
kws_transformer (KWSTransfor (100, 192)                5358528   
_________________________________________________________________
sequential_12 (Sequential)   multiple                  2316      
=================================================================
Total params: 5,360,844
Trainable params: 5,360,844
Non-trainable params: 0
_________________________________________________________________