Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(512, 16000)]            0         
_________________________________________________________________
speech_features (SpeechFeatu (512, 98, 40)             0         
_________________________________________________________________
kws_transformer (KWSTransfor (512, 64)                 606528    
_________________________________________________________________
sequential_12 (Sequential)   multiple                  780       
=================================================================
Total params: 607,308
Trainable params: 607,308
Non-trainable params: 0
_________________________________________________________________