Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(1, 16000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 98, 40)               0         
_________________________________________________________________
kws_transformer (KWSTransfor (1, 128)                  2392704   
_________________________________________________________________
sequential_12 (Sequential)   multiple                  1548      
=================================================================
Total params: 2,394,252
Trainable params: 2,394,252
Non-trainable params: 0
_________________________________________________________________